lkolbly/cmsis-svd/data/Holtek/HT32F22366.svd
      </registers>
    </peripheral>
    <!--CKCU-->
    <peripheral>
      <name>CKCU</name>
      <version>1.1</version>
      <description>CKCU</description>
      <groupName>CKCU</groupName>
      <baseAddress>0x40088000</baseAddress>
      <size>32</size>
      <!--Bits-->
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size>
        <!--Bytes-->
        <usage>registers</usage>
        <!--registers/buffer/reserved-->
      </addressBlock>
      <interrupt>
        <name>CKRDY</name>
        <value>0</value>
      </interrupt>
      <registers>
        <!--CKCU_GCFGR-->
        <register>
          <name>CKCU_GCFGR</name>
          <displayName>CKCU_GCFGR</displayName>
          <description>CKCU_GCFGR</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CKOUTSRC</name>
              <description>CKOUTSRC</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PLLSRC</name>
              <description>PLLSRC</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CKREFPRE</name>
              <description>CKREFPRE</description>
              <bitRange>[15:11]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>USBPRE</name>
              <description>USBPRE</description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>LPMOD</name>
              <description>LPMOD</description>
              <bitRange>[31:29]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--CKCU_GCCR-->
        <register>
          <name>CKCU_GCCR</name>
          <displayName>CKCU_GCCR</displayName>
          <description>CKCU_GCCR</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>SW</name>
              <description>SW</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PLLEN</name>
              <description>PLLEN</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>HSEEN</name>
              <description>HSEEN</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>HSIEN</name>
              <description>HSIEN</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CKMEN</name>
              <description>CKMEN</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PSRCEN</name>
              <description>PSRCEN</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--CKCU_GCSR-->
        <register>
          <name>CKCU_GCSR</name>
          <displayName>CKCU_GCSR</displayName>
          <description>CKCU_GCSR</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PLLRDY</name>
              <description>PLLRDY</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>HSERDY</name>
              <description>HSERDY</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>HSIRDY</name>
              <description>HSIRDY</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>LSERDY</name>
              <description>LSERDY</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>LSIRDY</name>
              <description>LSIRDY</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
