lkolbly/cmsis-svd/data/Holtek/HT32F22366.svd
        <!--AFIO_GPCCFGLR-->
        <register>
          <name>AFIO_GPCCFGLR</name>
          <displayName>AFIO_GPCCFGLR</displayName>
          <description>AFIO_GPCCFGLR</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PCCFG0</name>
              <description>PCCFG0</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PCCFG1</name>
              <description>PCCFG1</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PCCFG2</name>
              <description>PCCFG2</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PCCFG3</name>
              <description>PCCFG3</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PCCFG4</name>
              <description>PCCFG4</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PCCFG5</name>
              <description>PCCFG5</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PCCFG6</name>
              <description>PCCFG6</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PCCFG7</name>
              <description>PCCFG7</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--AFIO_GPCCFGHR-->
        <register>
          <name>AFIO_GPCCFGHR</name>
          <displayName>AFIO_GPCCFGHR</displayName>
          <description>AFIO_GPCCFGHR</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PCCFG8</name>
              <description>PCCFG8</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PCCFG9</name>
              <description>PCCFG9</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PCCFG10</name>
              <description>PCCFG10</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PCCFG11</name>
              <description>PCCFG11</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PCCFG12</name>
              <description>PCCFG12</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PCCFG13</name>
              <description>PCCFG13</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PCCFG14</name>
              <description>PCCFG14</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PCCFG15</name>
              <description>PCCFG15</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--AFIO_GPDCFGLR-->
        <register>
          <name>AFIO_GPDCFGLR</name>
          <displayName>AFIO_GPDCFGLR</displayName>
          <description>AFIO_GPDCFGLR</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PDCFG0</name>
              <description>PDCFG0</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PDCFG1</name>
              <description>PDCFG1</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PDCFG2</name>
              <description>PDCFG2</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PDCFG3</name>
              <description>PDCFG3</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PDCFG4</name>
              <description>PDCFG4</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PDCFG5</name>
              <description>PDCFG5</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PDCFG6</name>
              <description>PDCFG6</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PDCFG7</name>
              <description>PDCFG7</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--AFIO_GPDCFGHR-->
        <register>
          <name>AFIO_GPDCFGHR</name>
          <displayName>AFIO_GPDCFGHR</displayName>
          <description>AFIO_GPDCFGHR</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PDCFG8</name>
              <description>PDCFG8</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PDCFG9</name>
              <description>PDCFG9</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PDCFG10</name>
              <description>PDCFG10</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PDCFG11</name>
              <description>PDCFG11</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PDCFG12</name>
              <description>PDCFG12</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PDCFG13</name>
              <description>PDCFG13</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PDCFG14</name>
              <description>PDCFG14</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PDCFG15</name>
              <description>PDCFG15</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
