lkolbly/cmsis-svd/data/Holtek/HT32F22366.svd
        <!--USB_EP0CSR-->
        <register>
          <name>USB_EP0CSR</name>
          <displayName>USB_EP0CSR</displayName>
          <description>USB_EP0CSR</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>DTGTX</name>
              <description>DTGTX</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>NAKTX</name>
              <description>NAKTX</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>STLTX</name>
              <description>STLTX</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DTGRX</name>
              <description>DTGRX</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>NAKRX</name>
              <description>NAKRX</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>STLRX</name>
              <description>STLRX</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--USB_EP0IER-->
        <register>
          <name>USB_EP0IER</name>
          <displayName>USB_EP0IER</displayName>
          <description>USB_EP0IER</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>OTRXIE</name>
              <description>OTRXIE</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ODRXIE</name>
              <description>ODRXIE</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ODOVIE</name>
              <description>ODOVIE</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ITRXIE</name>
              <description>ITRXIE</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>IDTXIE</name>
              <description>IDTXIE</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>NAKIE</name>
              <description>NAKIE</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>STLIE</name>
              <description>STLIE</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>UERIE</name>
              <description>UERIE</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>STRXIE</name>
              <description>STRXIE</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SDRXIE</name>
              <description>SDRXIE</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SDERIE</name>
              <description>SDERIE</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ZLRXIE</name>
              <description>ZLRXIE</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--USB_EP0ISR-->
        <register>
          <name>USB_EP0ISR</name>
          <displayName>USB_EP0ISR</displayName>
          <description>USB_EP0ISR</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>OTRXIF</name>
              <description>OTRXIF</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ODRXIF</name>
              <description>ODRXIF</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ODOVIF</name>
              <description>ODOVIF</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ITRXIF</name>
              <description>ITRXIF</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>IDTXIF</name>
              <description>IDTXIF</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>NAKIF</name>
              <description>NAKIF</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>STLIF</name>
              <description>STLIF</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>UERIF</name>
              <description>UERIF</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>STRXIF</name>
              <description>STRXIF</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SDRXIF</name>
              <description>SDRXIF</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SDERIF</name>
              <description>SDERIF</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ZLRXIF</name>
              <description>ZLRXIF</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--USB_EP0TCR-->
        <register>
          <name>USB_EP0TCR</name>
          <displayName>USB_EP0TCR</displayName>
          <description>USB_EP0TCR</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>TXCNT</name>
              <description>TXCNT</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RXCNT</name>
              <description>RXCNT</description>
              <bitRange>[22:16]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--USB_EP0CFGR-->
        <register>
          <name>USB_EP0CFGR</name>
          <displayName>USB_EP0CFGR</displayName>
          <description>USB_EP0CFGR</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>EPBUFA</name>
              <description>EPBUFA</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>EPLEN</name>
              <description>EPLEN</description>
              <bitRange>[16:10]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>EPADR</name>
              <description>EPADR</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>EPEN</name>
              <description>EPEN</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
